from pymongo import MongoClient

client = MongoClient("mongodb://localhost:27017/")
db = client["score"]
collection = db["details"]

details = [
    {
        "직원명": "김민정",
 	"부서": "마케팅팀",
        "성적": [{"성과(40점)" : 35,
			"협업(30점)" : 26,
			"책임감(30점)" : 28,
			"총점" : "89"}],
	"평가": "성실하고 적극적임"
    },
 {
       "직원명": "이지훈",
 	"부서": "개발팀",
        "성적": [{"성과(40점)" : 38,
			"협업(30점)" : 28,
			"책임감(30점)" : 30,
			"총점" : "96"}],
	"평가": "주도적으로 업무수행"

    },
 {
        "직원명": "최수연",
 	"부서": "인사팀",
        "성적": [{"성과(40점)" : 32,
			"협업(30점)" : 25,
			"책임감(30점)" : 27,
			"총점" : "84"}],
	"평가": "개선점에 대한 피드백 반영 우수"

    },

    ]

collection.insert_many(details)
print("✅ 작업자 및 근무 기록 데이터 삽입 완료")